In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [2]:
%%sql
create table employees (
    employee_id int primary key,
    first_name varchar(50) not null,
    last_name varchar(50) not null,
    hire_date date not null,
    salary decimal(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [3]:
%%sql
alter table employees add email varchar(25);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [4]:
%%sql
desc employees

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, ''),
 ('email', 'varchar(25)', 'YES', '', None, '')]

In [5]:
%%sql
alter table employees drop column salary

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [6]:
%%sql
desc employees

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('email', 'varchar(25)', 'YES', '', None, '')]

In [7]:
%%sql
alter table employees rename to emp_123

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [8]:
%%sql
desc employees

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'test.employees' doesn't exist
[SQL: desc employees]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [9]:
%%sql
desc emp_123

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('email', 'varchar(25)', 'YES', '', None, '')]